# LoadUseLocalCoordinateSystem Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LoadUseLocalCoordinateSystem Property
ParameterTypeId Class See Also
---
"Orient to"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LoadUseLocalCoordinateSystem { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LoadUseLocalCoordinateSystem As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LoadUseLocalCoordinateSystem {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace